package com.javarush.task.task23.task2312;

/**
 * Created by Work-TESTER on 06.06.2017.
 */
/*
Змейка(2)
Теперь самое интересное — как будет устроена змея.

Что можно сказать о змее:
а) По сути — змея это набор кусочков — клеточек. Но точно известно, что один из них — голова.
б) У змеи есть направление движения.

Так что нам еще понадобятся классы:
SnakeSection — кусочек змеи.
SnakeDirection — класс (enum) будет описывать направление движения змеи.

Создай классы SnakeSection и SnakeDirection.


Требования:
1. Класс SnakeSection должен быть создан в отдельном файле.
2. Перечисление(enum) SnakeDirection должно быть создано в отдельном файле.
 */
public class SnakeSection {
}
